
## Plan Result (demo)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.db-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
* Update
  * azurerm_private_endpoint.vh_vnet_private_endpoint[0]
  * module.storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_private_endpoint.cvp_vnet_private_endpoint[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_private_endpoint.cvp_vnet_private_endpoint[0] must be replaced
-/+ resource "azurerm_private_endpoint" "cvp_vnet_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/privateEndpoints/emhrsapidemo" -> (known after apply)
        name                          = "emhrsapidemo"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/networkInterfaces/emhrsapidemo.nic.d2d5489d-12d9-433d-ba4b-885e4a6c3394"
              - name = "emhrsapidemo.nic.d2d5489d-12d9-433d-ba4b-885e4a6c3394"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/privateEndpoints/emhrsapidemo/privateDnsZoneGroups/endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "emhrsapidemo.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.50.11.6",
                        ]
                      - name         = "emhrsapidemo"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ resource_group_name           = "cvp-recordings-sbox-rg" -> "cvp-recordings-stg-rg" # forces replacement
      ~ subnet_id                     = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/virtualNetworks/cvp-recordings-sbox-vnet/subnets/wowza" -> "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/cvp-recordings-stg-rg/providers/Microsoft.Network/virtualNetworks/cvp-recordings-stg-vnet/subnets/wowza" # forces replacement
      ~ tags                          = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "demo"
          - "expiresAfter"        = "2025-04-23" -> null
            "managedBy"           = "Evidence Management"
        }
        # (2 unchanged attributes hidden)

      - private_dns_zone_group {
          - id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/privateEndpoints/emhrsapidemo/privateDnsZoneGroups/endpoint-dnszonegroup" -> null
          - name                 = "endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ] -> null
        }

      ~ private_service_connection {
            name                              = "emhrsapidemo"
          ~ private_ip_address                = "10.50.11.6" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_private_endpoint.vh_vnet_private_endpoint[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "vh_vnet_private_endpoint" {
        id                            = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/vh-infra-wowza-demo/providers/Microsoft.Network/privateEndpoints/emhrsapidemo"
        name                          = "emhrsapidemo"
        tags                          = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "demo"
            "managedBy"           = "Evidence Management"
        }
        # (7 unchanged attributes hidden)

      - private_dns_zone_group {
          - id                   = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/vh-infra-wowza-demo/providers/Microsoft.Network/privateEndpoints/emhrsapidemo/privateDnsZoneGroups/endpoint-dnszonegroup" -> null
          - name                 = "endpoint-dnszonegroup" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ] -> null
        }

        # (1 unchanged block hidden)
    }

  # module.db-v15.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "em-hrs-api-postgres-db-v15-data-demo"
      + server_name         = "em-hrs-api-postgres-db-v15-demo"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/em-hrs-api-demo/providers/Microsoft.Storage/storageAccounts/emhrsapidemo"
        name                               = "emhrsapidemo"
        tags                               = {
            "application"         = "evidence-management"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "demo"
            "managedBy"           = "Evidence Management"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ cvp_vnet_private_endpoint = [
      ~ "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/cvp-recordings-sbox-rg/providers/Microsoft.Network/privateEndpoints/emhrsapidemo" -> (known after apply),
    ]
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2438,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->